# How to explore a pandas dataframe:

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("Students_Performance.csv")
data.head()

,gender,race,level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
data.dtypes

gender                     object
race                       object
level_of_education         object
lunch                      object
test_preparation_course    object
math_score                  int64
reading_score               int64
writing_score               int64
dtype: object

In [4]:
data['level_of_education'].describe()

count             1000
unique               6
top       some college
freq               226
Name: level_of_education, dtype: object

In [5]:
data['level_of_education'].count()

1000

In [6]:
data['level_of_education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [7]:
data['level_of_education'].nunique()

6

In [8]:
data['level_of_education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: level_of_education, dtype: int64

In [9]:
data['level_of_education'].value_counts(normalize = True)

some college          0.226
associate's degree    0.222
high school           0.196
some high school      0.179
bachelor's degree     0.118
master's degree       0.059
Name: level_of_education, dtype: float64

In [10]:
pd.crosstab(data.level_of_education, data.race)

race                group A  group B  group C  group D  group E
level_of_education
associate's degree       14       41       78       50       39
bachelor's degree        12       20       40       28       18
high school              18       48       64       44       22
master's degree           3        6       19       23        8
some college             18       37       69       67       35
some high school         24       38       49       50       18

In [12]:
14+41+78+50+39

222

In [13]:
data.math_score.describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math_score, dtype: float64

In [14]:
data['math_score'].max()

100

In [15]:
data['math_score'].value_counts()

65    36
62    35
59    32
69    32
73    27
61    27
67    26
63    26
68    26
71    26
58    25
74    25
77    24
53    24
66    24
81    22
79    22
75    21
76    21
64    20
82    18
70    18
54    18
55    18
57    18
52    18
72    18
49    17
80    17
60    16
      ..
97     6
42     6
41     6
89     6
35     5
43     5
37     4
93     4
39     4
29     3
32     3
99     3
38     3
98     3
96     3
30     2
36     2
95     2
27     2
34     2
33     1
28     1
26     1
24     1
23     1
22     1
19     1
18     1
8      1
0      1
Name: math_score, Length: 81, dtype: int64